<a href="https://colab.research.google.com/github/ralsouza/organizing_and_visualizing_data_python/blob/master/notebooks/19_python_pandas_join_tables.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

# Data Creation

In [7]:
# data1
data1 = pd.DataFrame({
    'discipline_id': ['1','2','3','4','5'],
    'name': ['Bernardo','Alan','Mateus','Ivo','Gerson'],
    'last_name': ['Anderson','Teixeira','Amoedo','Trindade','Vargas']})

data1

  discipline_id      name last_name
0             1  Bernardo  Anderson
1             2      Alan  Teixeira
2             3    Mateus    Amoedo
3             4       Ivo  Trindade
4             5    Gerson    Vargas

In [9]:
# data2
data2 = pd.DataFrame({
    'discipline_id': ['1','2','3','4','5'],
    'name': ['Roberto','Mariana','Ana','Marcos','Maria'],
    'last_name': ['Sampaio','Fernandes','Arantes','Menezes','Martins']})

data2

  discipline_id     name  last_name
0             1  Roberto    Sampaio
1             2  Mariana  Fernandes
2             3      Ana    Arantes
3             4   Marcos    Menezes
4             5    Maria    Martins

In [12]:
# data3
data3 = pd.DataFrame({
    'discipline_id':['1','2','3','4','5','6','7','8','9','10','11'],
    'test_id': [81,75,75,71,76,84,95,61,57,90,85]})

data3

   discipline_id  test_id
0              1       81
1              2       75
2              3       75
3              4       71
4              5       76
5              6       84
6              7       95
7              8       61
8              9       57
9             10       90
10            11       85